app/views/shops/show.html.erb

</center>
<% @product.assignments.each do |assignment| %>
---
SELECT "assignments".* FROM "assignments" WHERE "assignments"."product_id" = ?  [["product_id", 4]]