app/views/cards/_card.html.erb

SELECT  "order_items".* FROM "order_items" WHERE "order_items"."order_id" = ? AND "order_items"."id" = ? LIMIT ?  [["order_id", 1], ["id", 1], ["LIMIT", 1]]
SELECT COUNT(*) FROM "order_items" WHERE "order_items"."order_id" = ?  [["order_id", 1]]
---
<%= link_to "Cart has #{current_order.order_items.size} items worth #{current_order.subtotal } Rs.", cards_path%>