app/views/products/_form.html.erb


  <% Color.all.each do |color| %>
---
SELECT "colors".* FROM "colors"

      <%= f.number_field :quantity %>
      <%= f.collection_select(:color_id, Color.all, :id, :color) %>
---
SELECT "colors".* FROM "colors"