app/views/products/show.html.erb

SELECT "assignments".* FROM "assignments" WHERE "assignments"."product_id" = ?  [["product_id", 5]]
---

<% @product.assignments.each do |a| %>